app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "本3"], ["body", "本やで"], ["created_at", "2019-10-14 06:51:53.846874"], ["updated_at", "2019-10-14 06:51:53.846874"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
  	if @book.save
  		flash[:notice]="Book was successfully created."
  		redirect_to book_path(@book)
  	else
  		binding.pry
  		flash[:notice]="error"
  		@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "本だね"], ["updated_at", "2019-10-14 07:21:45.868531"], ["id", 5]]
---
  def update
  	book = Book.find(params[:id])
  	if book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 6]]
---
  def destroy
  	flash[:notice]="Book was successfully destroyed."
  	book = Book.find(params[:id])
  	book.destroy